package com.demo.test;

import android.graphics.Color;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.content.ContextCompat;
import com.bin.david.form.core.SmartTable;
import com.bin.david.form.core.TableConfig;
import com.bin.david.form.data.CellInfo;
import com.bin.david.form.data.format.bg.BaseCellBackgroundFormat;
import com.bin.david.form.data.style.FontStyle;
import com.bin.david.form.data.table.MapTableData;
import com.bin.david.form.utils.DensityUtils;
import com.demo.test.myapplication36.R;
import com.demo.test.util.JsonUtil;

import java.util.List;


//import static com.example.administrator.myapplication36.R.id.btn1;

public class SmartTableActivity extends AppCompatActivity
{
    private SmartTable table;
    @Override
    public void onCreate(Bundle savedInstanceState)
    {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_smart_table);
        initView();
        setTableConfig();
        getDatas();
    }

    private void initView() {
        table = (SmartTable) findViewById(R.id.table);
    }
    private void setTableConfig() {

        table.getConfig().setContentCellBackgroundFormat(new BaseCellBackgroundFormat<CellInfo>() {
            @Override
            public int getBackGroundColor(CellInfo cellInfo) {
                if(cellInfo.row %2 == 1) {
                    return ContextCompat.getColor(SmartTableActivity.this, R.color.gray_lighter);
                }
                return TableConfig.INVALID_COLOR;
            }

        });
        //设置缩放值(max与min)
        table.setZoom(true,3f,0.5f);
        //设置是否显示顶部序号列
        table.getConfig().setShowXSequence(false);
        //设置是否显示左侧序号列
        table.getConfig().setShowYSequence(false);

        table.getConfig().setTableTitleStyle(new FontStyle(DensityUtils.sp2px(this,18), Color.RED));
        table.getConfig().setColumnTitleVerticalPadding(DensityUtils.sp2px(this,8));
        table.getConfig().setVerticalPadding(DensityUtils.sp2px(this,8));
    }

    private void getDatas() {
         String title = "表名";
         String getDatas = "[{\"宿舍楼\":\"第一栋\",\"宿舍1001人数\":\"8\",\"宿舍1002人数\":\"2\",\"宿舍1003人数\":\"2\",\"宿舍1004人数\":\"1\",\"宿舍1005人数\":\"6\",\"宿舍1006人数\":\"6\"}," +
                 "{\"宿舍楼\":\"第二栋\",\"宿舍1001人数\":\"2\",\"宿舍1002人数\":\"3\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第三栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第四栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第五栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第六栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第七栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第八栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第九栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十一栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十二栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十三栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十四栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十五栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十六栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十七栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十八栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第十九栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第二十栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第二十一栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第二十二栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第二十三栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第三十四栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}," +
                 "{\"宿舍楼\":\"第三十五栋\",\"宿舍1001人数\":\"3\",\"宿舍1002人数\":\"1\",\"宿舍1003人数\":\"3\",\"宿舍1004人数\":\"2\",\"宿舍1005人数\":\"7\",\"宿舍1006人数\":\"8\"}]";
        List<Object> json = JsonUtil.jsonToObjs(getDatas, Object.class);
        MapTableData tableData = MapTableData.create(title, json,null);
        table.setTableData(tableData);
    }
}
